(function() {
    let track = 0;
    function renderFrame(f) {
        clearAllEditorHighlights();
        clearCanvas();
        switch(f) {
            case 0:
                if (track === 0) {
                    drawText("這是線篩{的演算法視覺化範例}", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(109);
                    drawArray('prime', 0, 560, [],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(110);
                    drawArray('isprime', 0, 90, [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "focus", elements: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 1:
                if (track === 0) {
                    drawColoredText([{text: "首先因為"},{text: "1不是質數", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "所以先刪掉"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(21);
                    drawArray('prime', 0, 560, [],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(22);
                    drawArray('isprime', 0, 90, [0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "background", elements: [1]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 2:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[2]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[2]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉2{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [2]},{ type: "mark", elements: [0,1]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [2,4]},{ type: "focus", elements: [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [2]},{ type: "mark", elements: [0,1]},{ type: "background", elements: [4]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 3 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 3:
                if (track === 0) {
                    drawText("因為 2{×:乘}2=4\n所以殺掉 4", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [2,4]},{ type: "focus", elements: [2,3,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [2]},{ type: "mark", elements: [0,1]},{ type: "background", elements: [4]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 1 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 3 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 4:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[3]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[3]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉3{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [3]},{ type: "focus", elements: [2,3,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [3]},{ type: "mark", elements: [0,1,2]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [3,6,9]},{ type: "focus", elements: [2,3,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [3]},{ type: "mark", elements: [0,1,2]},{ type: "background", elements: [6,9]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 5 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 8 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 5:
                if (track === 0) {
                    drawText("因為 3{×:乘}2=6\n所以殺掉 6", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [3,6]},{ type: "focus", elements: [2,3,5,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [3]},{ type: "mark", elements: [0,1,2]},{ type: "background", elements: [6]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 2 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 5 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 6:
                if (track === 0) {
                    drawText("因為 3{×:乘}3=9\n所以殺掉 9", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [3,9]},{ type: "focus", elements: [2,3,5,7,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [3]},{ type: "mark", elements: [0,1,2]},{ type: "background", elements: [9]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 2 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 8 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 7:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[4]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[4]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 4{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [4]},{ type: "focus", elements: [2,3,5,7,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [4]},{ type: "mark", elements: [0,1,2,3]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [4,8]},{ type: "focus", elements: [2,3,5,7,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [4]},{ type: "mark", elements: [0,1,2,3]},{ type: "background", elements: [8]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 7 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 8:
                if (track === 0) {
                    drawText("因為 4{×:乘}2=8\n所以殺掉 8", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [4,8]},{ type: "focus", elements: [2,3,5,7,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [4]},{ type: "mark", elements: [0,1,2,3]},{ type: "background", elements: [8]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 3 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 7 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 9:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "4{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [4,12]},{ type: "focus", elements: [2,3,5,7,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [4]},{ type: "mark", elements: [0,1,2,3]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [12]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 3 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 11 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 10:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[5]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[5]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉5{×:乘}[2,3,5] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [5]},{ type: "focus", elements: [2,3,5,7,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [5]},{ type: "mark", elements: [0,1,2,3,4]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [0,1,2]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [5,10,15,25]},{ type: "focus", elements: [2,3,5,7,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [5]},{ type: "mark", elements: [0,1,2,3,4]},{ type: "background", elements: [10,15,25]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 9 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 14 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 24 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 11:
                if (track === 0) {
                    drawText("因為 5{×:乘}2=10\n所以殺掉 10", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [5,10]},{ type: "focus", elements: [2,3,5,7,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [5]},{ type: "mark", elements: [0,1,2,3,4]},{ type: "background", elements: [10]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 4 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 9 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 12:
                if (track === 0) {
                    drawText("因為 5{×:乘}3=15\n所以殺掉 15", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [5,15]},{ type: "focus", elements: [2,3,5,7,11,12,13,14,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [5]},{ type: "mark", elements: [0,1,2,3,4]},{ type: "background", elements: [15]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 4 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 14 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 13:
                if (track === 0) {
                    drawText("因為 5{×:乘}5=25\n所以殺掉 25", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [5,25]},{ type: "focus", elements: [2,3,5,7,11,12,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [5]},{ type: "mark", elements: [0,1,2,3,4]},{ type: "background", elements: [25]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 4 }, { group: "prime", index: 2 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 24 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 14:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[6]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[6]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 6{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [6]},{ type: "focus", elements: [2,3,5,7,11,12,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [6]},{ type: "mark", elements: [0,1,2,3,4,5]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [6,12]},{ type: "focus", elements: [2,3,5,7,11,12,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [6]},{ type: "mark", elements: [0,1,2,3,4,5]},{ type: "background", elements: [12]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 11 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 15:
                if (track === 0) {
                    drawText("因為 6{×:乘}2=12\n所以殺掉 12", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [6,12]},{ type: "focus", elements: [2,3,5,7,11,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [6]},{ type: "mark", elements: [0,1,2,3,4,5]},{ type: "background", elements: [12]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 5 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 11 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 16:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "6{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [6,18]},{ type: "focus", elements: [2,3,5,7,11,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [6]},{ type: "mark", elements: [0,1,2,3,4,5]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [18]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 5 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 17 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 17:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[7]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[7]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉7{×:乘}[2,3,5,7] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [7]},{ type: "focus", elements: [2,3,5,7,11,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [7]},{ type: "mark", elements: [0,1,2,3,4,5,6]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0,1,2,3]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [7,14,21,35,49]},{ type: "focus", elements: [2,3,5,7,11,13,14,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [7]},{ type: "mark", elements: [0,1,2,3,4,5,6]},{ type: "background", elements: [14,21,35,49]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 13 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 20 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 34 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 3 }, { group: "isprime", index: 48 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 18:
                if (track === 0) {
                    drawText("因為 7{×:乘}2=14\n所以殺掉 14", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [7,14]},{ type: "focus", elements: [2,3,5,7,11,13,16,17,18,19,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [7]},{ type: "mark", elements: [0,1,2,3,4,5,6]},{ type: "background", elements: [14]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 6 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 13 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 19:
                if (track === 0) {
                    drawText("因為 7{×:乘}3=21\n所以殺掉 21", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [7,21]},{ type: "focus", elements: [2,3,5,7,11,13,16,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [7]},{ type: "mark", elements: [0,1,2,3,4,5,6]},{ type: "background", elements: [21]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 6 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 20 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 20:
                if (track === 0) {
                    drawText("因為 7{×:乘}5=35\n所以殺掉 35", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [7,35]},{ type: "focus", elements: [2,3,5,7,11,13,16,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [7]},{ type: "mark", elements: [0,1,2,3,4,5,6]},{ type: "background", elements: [35]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 6 }, { group: "prime", index: 2 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 34 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 21:
                if (track === 0) {
                    drawText("因為 7{×:乘}7=49\n所以殺掉 49", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [3]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [7,49]},{ type: "focus", elements: [2,3,5,7,11,13,16,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [7]},{ type: "mark", elements: [0,1,2,3,4,5,6]},{ type: "background", elements: [49]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 6 }, { group: "prime", index: 3 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 3 }, { group: "isprime", index: 48 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 22:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[8]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[8]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 8{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [8]},{ type: "focus", elements: [2,3,5,7,11,13,16,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [8]},{ type: "mark", elements: [0,1,2,3,4,5,6,7]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [8,16]},{ type: "focus", elements: [2,3,5,7,11,13,16,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [8]},{ type: "mark", elements: [0,1,2,3,4,5,6,7]},{ type: "background", elements: [16]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 15 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 23:
                if (track === 0) {
                    drawText("因為 8{×:乘}2=16\n所以殺掉 16", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [8,16]},{ type: "focus", elements: [2,3,5,7,11,13,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [8]},{ type: "mark", elements: [0,1,2,3,4,5,6,7]},{ type: "background", elements: [16]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 7 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 15 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 24:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "8{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [8,24]},{ type: "focus", elements: [2,3,5,7,11,13,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [8]},{ type: "mark", elements: [0,1,2,3,4,5,6,7]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [24]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 7 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 23 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 25:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[9]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[9]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 9{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [9]},{ type: "focus", elements: [2,3,5,7,11,13,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [9]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [9,18,27]},{ type: "focus", elements: [2,3,5,7,11,13,17,18,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [9]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8]},{ type: "background", elements: [18,27]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 17 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 26 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 26:
                if (track === 0) {
                    drawText("因為 9{×:乘}2=18\n所以殺掉 18", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [9,18]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,20,22,23,24,26,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [9]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8]},{ type: "background", elements: [18]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 8 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 17 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 27:
                if (track === 0) {
                    drawText("因為 9{×:乘}3=27\n所以殺掉 27", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [9,27]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,20,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [9]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8]},{ type: "background", elements: [27]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 8 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 26 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 28:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "9{%:能夠整除}3=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [9,45]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,20,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [9]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [45]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 8 }, { group: "prime", index: 2 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 44 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 29:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[10]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[10]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 10{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [10]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,20,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [10]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [10,20]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,20,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [10]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9]},{ type: "background", elements: [20]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 19 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 30:
                if (track === 0) {
                    drawText("因為 10{×:乘}2=20\n所以殺掉 20", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [10,20]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [10]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9]},{ type: "background", elements: [20]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 9 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 19 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 31:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "10{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [10,30]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [10]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [30]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 9 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 29 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 32:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[11]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[11]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉11{×:乘}[2,3,5,7] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [0,1,2,3]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11,22,33,55,77]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,22,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]},{ type: "background", elements: [22,33,55,77]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 21 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 32 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 54 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 3 }, { group: "isprime", index: 76 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 33:
                if (track === 0) {
                    drawText("因為 11{×:乘}2=22\n所以殺掉 22", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11,22]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]},{ type: "background", elements: [22]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 10 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 21 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 34:
                if (track === 0) {
                    drawText("因為 11{×:乘}3=33\n所以殺掉 33", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11,33]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]},{ type: "background", elements: [33]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 10 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 32 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 35:
                if (track === 0) {
                    drawText("因為 11{×:乘}5=55\n所以殺掉 55", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11,55]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]},{ type: "background", elements: [55]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 10 }, { group: "prime", index: 2 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 54 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 36:
                if (track === 0) {
                    drawText("因為 11{×:乘}7=77\n所以殺掉 77", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [3]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11,77]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]},{ type: "background", elements: [77]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 10 }, { group: "prime", index: 3 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 3 }, { group: "isprime", index: 76 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 37:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "11{×:乘}11=121 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [4]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [11,121]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [11]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [121]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 38:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[12]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[12]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 12{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [12]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [12]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [12,24]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,24,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [12]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11]},{ type: "background", elements: [24]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 23 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 39:
                if (track === 0) {
                    drawText("因為 12{×:乘}2=24\n所以殺掉 24", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [12,24]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [12]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11]},{ type: "background", elements: [24]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 11 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 23 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 40:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "12{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [12,36]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [12]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [36]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 11 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 35 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 41:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[13]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[13]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉13{×:乘}[2,3,5,7] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0,1,2,3]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13,26,39,65,91]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,26,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]},{ type: "background", elements: [26,39,65,91]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 25 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 38 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 64 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 3 }, { group: "isprime", index: 90 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 42:
                if (track === 0) {
                    drawText("因為 13{×:乘}2=26\n所以殺掉 26", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13,26]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,39,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]},{ type: "background", elements: [26]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 12 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 25 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 43:
                if (track === 0) {
                    drawText("因為 13{×:乘}3=39\n所以殺掉 39", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13,39]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]},{ type: "background", elements: [39]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 12 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 38 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 44:
                if (track === 0) {
                    drawText("因為 13{×:乘}5=65\n所以殺掉 65", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13,65]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]},{ type: "background", elements: [65]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 12 }, { group: "prime", index: 2 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 64 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 45:
                if (track === 0) {
                    drawText("因為 13{×:乘}7=91\n所以殺掉 91", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [3]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13,91]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]},{ type: "background", elements: [91]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 12 }, { group: "prime", index: 3 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 3 }, { group: "isprime", index: 90 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 46:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "13{×:乘}11=143 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [4]},{ type: "focus", elements: [0,1,2,3]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [13,143]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [13]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [143]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 47:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[14]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[14]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 14{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [14]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [14]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [14,28]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,28,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [14]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13]},{ type: "background", elements: [28]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 27 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 48:
                if (track === 0) {
                    drawText("因為 14{×:乘}2=28\n所以殺掉 28", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [14,28]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [14]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13]},{ type: "background", elements: [28]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 13 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 27 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 49:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "14{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [14,42]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [14]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [42]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 13 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 41 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 50:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[15]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[15]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 15{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [15]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [15]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [15,30,45]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,30,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [15]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]},{ type: "background", elements: [30,45]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 29 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 44 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 51:
                if (track === 0) {
                    drawText("因為 15{×:乘}2=30\n所以殺掉 30", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [15,30]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,32,34,36,37,38,40,41,42,43,44,45,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [15]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]},{ type: "background", elements: [30]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 14 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 29 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 52:
                if (track === 0) {
                    drawText("因為 15{×:乘}3=45\n所以殺掉 45", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [15,45]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,32,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [15]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]},{ type: "background", elements: [45]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 14 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 44 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 53:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "15{%:能夠整除}3=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [15,75]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,32,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [15]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [75]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 14 }, { group: "prime", index: 2 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 74 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 54:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[16]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[16]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 16{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [16]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,32,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [16]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [16,32]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,32,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [16]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]},{ type: "background", elements: [32]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 31 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 55:
                if (track === 0) {
                    drawText("因為 16{×:乘}2=32\n所以殺掉 32", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [16,32]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [16]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]},{ type: "background", elements: [32]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 15 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 31 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 56:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "16{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [16,48]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [16]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [48]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 15 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 47 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 57:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[17]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[17]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉17{×:乘}[2,3,5] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [17]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [17]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [0,1,2]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [17,34,51,85]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,34,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [17]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]},{ type: "background", elements: [34,51,85]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 33 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 50 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 84 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 58:
                if (track === 0) {
                    drawText("因為 17{×:乘}2=34\n所以殺掉 34", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [17,34]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,36,37,38,40,41,42,43,44,46,47,48,50,51,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [17]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]},{ type: "background", elements: [34]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 16 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 33 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 59:
                if (track === 0) {
                    drawText("因為 17{×:乘}3=51\n所以殺掉 51", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [17,51]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,36,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [17]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]},{ type: "background", elements: [51]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 16 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 50 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 60:
                if (track === 0) {
                    drawText("因為 17{×:乘}5=85\n所以殺掉 85", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [17,85]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,36,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [17]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]},{ type: "background", elements: [85]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 16 }, { group: "prime", index: 2 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 84 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 61:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "17{×:乘}7=119 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [3]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [17,119]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,36,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [17]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [119]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 62:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[18]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[18]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 18{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [18]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,36,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [18]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [18,36]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,36,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [18]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]},{ type: "background", elements: [36]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 35 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 63:
                if (track === 0) {
                    drawText("因為 18{×:乘}2=36\n所以殺掉 36", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [18,36]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [18]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]},{ type: "background", elements: [36]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 17 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 35 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 64:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "18{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [18,54]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [18]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [54]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 17 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 53 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 65:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[19]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[19]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉19{×:乘}[2,3,5] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [19]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [19]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0,1,2]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [19,38,57,95]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,38,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [19]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},{ type: "background", elements: [38,57,95]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 37 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 56 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 94 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 66:
                if (track === 0) {
                    drawText("因為 19{×:乘}2=38\n所以殺掉 38", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [19,38]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,40,41,42,43,44,46,47,48,50,52,53,54,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [19]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},{ type: "background", elements: [38]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 18 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 37 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 67:
                if (track === 0) {
                    drawText("因為 19{×:乘}3=57\n所以殺掉 57", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [19,57]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,40,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,95,96,97,98,99,100]},{ type: "point", elements: [19]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},{ type: "background", elements: [57]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 18 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 56 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 68:
                if (track === 0) {
                    drawText("因為 19{×:乘}5=95\n所以殺掉 95", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [19,95]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,40,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [19]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},{ type: "background", elements: [95]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 18 }, { group: "prime", index: 2 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 94 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 69:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "19{×:乘}7=133 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [3]},{ type: "focus", elements: [0,1,2]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [19,133]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,40,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [19]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [133]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 70:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[20]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[20]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 20{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [20]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,40,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [20]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [20,40]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,40,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [20]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19]},{ type: "background", elements: [40]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 39 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 71:
                if (track === 0) {
                    drawText("因為 20{×:乘}2=40\n所以殺掉 40", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [20,40]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [20]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19]},{ type: "background", elements: [40]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 19 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 39 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 72:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "20{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [20,60]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [20]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [60]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 19 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 59 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 73:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[21]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[21]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 21{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [21]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [21]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [21,42,63]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,42,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [21]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},{ type: "background", elements: [42,63]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 41 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 62 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 74:
                if (track === 0) {
                    drawText("因為 21{×:乘}2=42\n所以殺掉 42", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [21,42]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [21]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},{ type: "background", elements: [42]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 20 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 41 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 75:
                if (track === 0) {
                    drawText("因為 21{×:乘}3=63\n所以殺掉 63", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [21,63]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [21]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},{ type: "background", elements: [63]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 20 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 62 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 76:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "21{%:能夠整除}3=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [21,105]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [21]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [105]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 20 }, { group: "prime", index: 2 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 104 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 77:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[22]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[22]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 22{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [22]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [22]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [22,44]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,44,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [22]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21]},{ type: "background", elements: [44]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 43 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 78:
                if (track === 0) {
                    drawText("因為 22{×:乘}2=44\n所以殺掉 44", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [22,44]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [22]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21]},{ type: "background", elements: [44]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 21 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 43 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 79:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "22{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [22,66]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [22]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [66]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 21 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 65 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 80:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[23]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[23]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉23{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [23]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [23]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [23,46,69]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,46,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [23]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22]},{ type: "background", elements: [46,69]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 45 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 68 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 81:
                if (track === 0) {
                    drawText("因為 23{×:乘}2=46\n所以殺掉 46", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [23,46]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [23]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22]},{ type: "background", elements: [46]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 22 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 45 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 82:
                if (track === 0) {
                    drawText("因為 23{×:乘}3=69\n所以殺掉 69", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [23,69]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [23]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22]},{ type: "background", elements: [69]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 22 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 68 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 83:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "23{×:乘}5=115 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [23,115]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [23]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [115]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 84:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[24]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[24]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 24{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [24]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [24]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [24,48]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,48,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [24]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},{ type: "background", elements: [48]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 47 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 85:
                if (track === 0) {
                    drawText("因為 24{×:乘}2=48\n所以殺掉 48", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [24,48]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [24]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},{ type: "background", elements: [48]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 23 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 47 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 86:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "24{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [24,72]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [24]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [72]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 23 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 71 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 87:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[25]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[25]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 25{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [25]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [25]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [25,50,75]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,50,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [25]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]},{ type: "background", elements: [50,75]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 49 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 74 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 88:
                if (track === 0) {
                    drawText("因為 25{×:乘}2=50\n所以殺掉 50", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [25,50]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,75,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [25]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]},{ type: "background", elements: [50]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 24 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 49 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 89:
                if (track === 0) {
                    drawText("因為 25{×:乘}3=75\n所以殺掉 75", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [25,75]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [25]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]},{ type: "background", elements: [75]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 24 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 74 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 90:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "25{×:乘}5=125 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [25,125]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [25]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [125]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 91:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[26]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[26]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 26{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [26]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [26]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [26,52]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,52,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [26]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]},{ type: "background", elements: [52]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 51 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 92:
                if (track === 0) {
                    drawText("因為 26{×:乘}2=52\n所以殺掉 52", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [26,52]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [26]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]},{ type: "background", elements: [52]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 25 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 51 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 93:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "26{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [26,78]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [26]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [78]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 25 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 77 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 94:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[27]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[27]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 27{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [27]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [27]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [27,54,81]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,54,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [27]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26]},{ type: "background", elements: [54,81]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 53 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 80 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 95:
                if (track === 0) {
                    drawText("因為 27{×:乘}2=54\n所以殺掉 54", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [27,54]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,81,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [27]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26]},{ type: "background", elements: [54]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 26 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 53 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 96:
                if (track === 0) {
                    drawText("因為 27{×:乘}3=81\n所以殺掉 81", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [27,81]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [27]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26]},{ type: "background", elements: [81]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 26 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 80 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 97:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "27{%:能夠整除}3=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [27,135]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [27]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [135]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 26 }, { group: "prime", index: 2 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 134 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 98:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[28]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[28]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 28{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [28]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [28]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [28,56]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,56,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [28]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27]},{ type: "background", elements: [56]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 55 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 99:
                if (track === 0) {
                    drawText("因為 28{×:乘}2=56\n所以殺掉 56", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [28,56]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [28]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27]},{ type: "background", elements: [56]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 27 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 55 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 100:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "28{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [28,84]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [28]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [84]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 27 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 83 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 101:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[29]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[29]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉29{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [29]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [29]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [29,58,87]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,58,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [29]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28]},{ type: "background", elements: [58,87]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 57 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 86 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 102:
                if (track === 0) {
                    drawText("因為 29{×:乘}2=58\n所以殺掉 58", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [29,58]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,87,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [29]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28]},{ type: "background", elements: [58]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 28 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 57 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 103:
                if (track === 0) {
                    drawText("因為 29{×:乘}3=87\n所以殺掉 87", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [29,87]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [29]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28]},{ type: "background", elements: [87]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 28 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 86 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 104:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "29{×:乘}5=145 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [29,145]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [29]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [145]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 105:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[30]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[30]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 30{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [30]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [30]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [30,60]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,60,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [30]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29]},{ type: "background", elements: [60]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 59 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 106:
                if (track === 0) {
                    drawText("因為 30{×:乘}2=60\n所以殺掉 60", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [30,60]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [30]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29]},{ type: "background", elements: [60]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 29 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 59 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 107:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "30{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [30,90]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [30]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [90]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 29 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 89 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 108:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[31]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[31]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉31{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [31]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [31]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [31,62,93]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,62,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [31]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]},{ type: "background", elements: [62,93]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 61 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 92 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 109:
                if (track === 0) {
                    drawText("因為 31{×:乘}2=62\n所以殺掉 62", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [31,62]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,93,94,96,97,98,99,100]},{ type: "point", elements: [31]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]},{ type: "background", elements: [62]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 30 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 61 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 110:
                if (track === 0) {
                    drawText("因為 31{×:乘}3=93\n所以殺掉 93", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [31,93]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [31]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]},{ type: "background", elements: [93]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 30 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 92 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 111:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "31{×:乘}5=155 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [31,155]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [31]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [155]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 112:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[32]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[32]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 32{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [32]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [32]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [32,64]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,64,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [32]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31]},{ type: "background", elements: [64]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 63 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 113:
                if (track === 0) {
                    drawText("因為 32{×:乘}2=64\n所以殺掉 64", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [32,64]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [32]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31]},{ type: "background", elements: [64]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 31 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 63 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 114:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "32{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [32,96]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [32]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [96]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 31 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 95 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 115:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[33]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[33]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 33{×:乘}[2,3] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [33]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [33]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0,1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [33,66,99]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,66,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [33]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32]},{ type: "background", elements: [66,99]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 65 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 98 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 116:
                if (track === 0) {
                    drawText("因為 33{×:乘}2=66\n所以殺掉 66", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1],  [{ type: "highlight", elements: [33,66]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,99,100]},{ type: "point", elements: [33]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32]},{ type: "background", elements: [66]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 32 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 65 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 117:
                if (track === 0) {
                    drawText("因為 33{×:乘}3=99\n所以殺掉 99", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [33,99]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [33]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32]},{ type: "background", elements: [99]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 32 }, { group: "prime", index: 1 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 98 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 118:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "33{%:能夠整除}3=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [2]},{ type: "focus", elements: [0,1]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [33,165]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [33]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [165]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 32 }, { group: "prime", index: 2 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 2 }, { group: "isprime", index: 164 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 119:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[34]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[34]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 34{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [34]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [34]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [34,68]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,68,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [34]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]},{ type: "background", elements: [68]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 67 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 120:
                if (track === 0) {
                    drawText("因為 34{×:乘}2=68\n所以殺掉 68", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [34,68]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [34]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]},{ type: "background", elements: [68]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 33 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 67 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 121:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "34{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [34,102]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [34]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [102]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 33 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 101 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 122:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[35]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[35]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 35{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [35]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [35]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [35,70]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,70,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [35]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34]},{ type: "background", elements: [70]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 69 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 123:
                if (track === 0) {
                    drawText("因為 35{×:乘}2=70\n所以殺掉 70", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [35,70]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [35]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34]},{ type: "background", elements: [70]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 34 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 69 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 124:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "35{×:乘}3=105 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [35,105]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [35]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [105]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 125:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[36]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[36]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 36{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [36]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [36]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [36,72]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,72,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [36]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35]},{ type: "background", elements: [72]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 71 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 126:
                if (track === 0) {
                    drawText("因為 36{×:乘}2=72\n所以殺掉 72", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [36,72]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [36]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35]},{ type: "background", elements: [72]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 35 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 71 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 127:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "36{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [36,108]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [36]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [108]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 35 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 107 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 128:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[37]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[37]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉37{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [37]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [37]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [37,74]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,74,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [37]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36]},{ type: "background", elements: [74]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 73 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 129:
                if (track === 0) {
                    drawText("因為 37{×:乘}2=74\n所以殺掉 74", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [37,74]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [37]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36]},{ type: "background", elements: [74]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 36 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 73 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 130:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "37{×:乘}3=111 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [37,111]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [37]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [111]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 131:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[38]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[38]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 38{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [38]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [38]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [38,76]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,76,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [38]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37]},{ type: "background", elements: [76]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 75 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 132:
                if (track === 0) {
                    drawText("因為 38{×:乘}2=76\n所以殺掉 76", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [38,76]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [38]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37]},{ type: "background", elements: [76]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 37 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 75 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 133:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "38{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [38,114]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [38]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [114]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 37 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 113 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 134:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[39]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[39]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 39{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [39]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [39]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [39,78]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,78,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [39]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38]},{ type: "background", elements: [78]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 77 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 135:
                if (track === 0) {
                    drawText("因為 39{×:乘}2=78\n所以殺掉 78", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [39,78]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [39]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38]},{ type: "background", elements: [78]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 38 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 77 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 136:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "39{×:乘}3=117 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [39,117]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [39]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [117]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 137:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[40]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[40]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 40{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [40]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [40]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [40,80]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,80,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [40]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39]},{ type: "background", elements: [80]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 79 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 138:
                if (track === 0) {
                    drawText("因為 40{×:乘}2=80\n所以殺掉 80", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [40,80]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [40]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39]},{ type: "background", elements: [80]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 39 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 79 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 139:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "40{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [40,120]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [40]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [120]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 39 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 119 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 140:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[41]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[41]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉41{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [41]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [41]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [41,82]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,82,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [41]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40]},{ type: "background", elements: [82]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 81 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 141:
                if (track === 0) {
                    drawText("因為 41{×:乘}2=82\n所以殺掉 82", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [41,82]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [41]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40]},{ type: "background", elements: [82]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 40 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 81 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 142:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "41{×:乘}3=123 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [41,123]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [41]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [123]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 143:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[42]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[42]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 42{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [42]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [42]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [42,84]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,84,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [42]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41]},{ type: "background", elements: [84]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 83 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 144:
                if (track === 0) {
                    drawText("因為 42{×:乘}2=84\n所以殺掉 84", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [42,84]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [42]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41]},{ type: "background", elements: [84]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 41 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 83 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 145:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "42{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [42,126]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [42]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [126]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 41 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 125 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 146:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[43]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[43]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉43{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [43]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [43]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [43,86]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,86,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [43]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42]},{ type: "background", elements: [86]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 85 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 147:
                if (track === 0) {
                    drawText("因為 43{×:乘}2=86\n所以殺掉 86", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [43,86]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [43]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42]},{ type: "background", elements: [86]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 42 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 85 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 148:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "43{×:乘}3=129 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [43,129]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [43]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [129]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 149:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[44]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[44]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 44{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [44]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [44]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [44,88]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,88,89,90,92,94,96,97,98,100]},{ type: "point", elements: [44]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43]},{ type: "background", elements: [88]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 87 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 150:
                if (track === 0) {
                    drawText("因為 44{×:乘}2=88\n所以殺掉 88", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [44,88]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,90,92,94,96,97,98,100]},{ type: "point", elements: [44]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43]},{ type: "background", elements: [88]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 43 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 87 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 151:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "44{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [44,132]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,90,92,94,96,97,98,100]},{ type: "point", elements: [44]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [132]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 43 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 131 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 152:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[45]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[45]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 45{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [45]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,90,92,94,96,97,98,100]},{ type: "point", elements: [45]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [45,90]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,90,92,94,96,97,98,100]},{ type: "point", elements: [45]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44]},{ type: "background", elements: [90]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 89 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 153:
                if (track === 0) {
                    drawText("因為 45{×:乘}2=90\n所以殺掉 90", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [45,90]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,92,94,96,97,98,100]},{ type: "point", elements: [45]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44]},{ type: "background", elements: [90]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 44 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 89 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 154:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "45{×:乘}3=135 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [45,135]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,92,94,96,97,98,100]},{ type: "point", elements: [45]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [135]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 155:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[46]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[46]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 46{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [46]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,92,94,96,97,98,100]},{ type: "point", elements: [46]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,1,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [46,92]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,92,94,96,97,98,100]},{ type: "point", elements: [46]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45]},{ type: "background", elements: [92]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 91 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 156:
                if (track === 0) {
                    drawText("因為 46{×:乘}2=92\n所以殺掉 92", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [46,92]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,94,96,97,98,100]},{ type: "point", elements: [46]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45]},{ type: "background", elements: [92]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 45 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 91 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 157:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "46{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [46,138]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,94,96,97,98,100]},{ type: "point", elements: [46]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [138]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 45 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 137 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 158:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[47]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[47]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉47{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [47]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,94,96,97,98,100]},{ type: "point", elements: [47]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [47,94]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,94,96,97,98,100]},{ type: "point", elements: [47]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46]},{ type: "background", elements: [94]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 93 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 159:
                if (track === 0) {
                    drawText("因為 47{×:乘}2=94\n所以殺掉 94", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [47,94]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,96,97,98,100]},{ type: "point", elements: [47]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46]},{ type: "background", elements: [94]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 46 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 93 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 160:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "47{×:乘}3=141 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [47,141]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,96,97,98,100]},{ type: "point", elements: [47]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [141]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 161:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[48]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[48]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 48{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [48]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,96,97,98,100]},{ type: "point", elements: [48]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [48,96]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,96,97,98,100]},{ type: "point", elements: [48]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47]},{ type: "background", elements: [96]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 95 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 162:
                if (track === 0) {
                    drawText("因為 48{×:乘}2=96\n所以殺掉 96", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [48,96]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,98,100]},{ type: "point", elements: [48]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47]},{ type: "background", elements: [96]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 47 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 95 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 163:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "48{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [48,144]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,98,100]},{ type: "point", elements: [48]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [144]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 47 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 143 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 164:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[49]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[49]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 49{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [49]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,98,100]},{ type: "point", elements: [49]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,1,1,1,1,1],  [{ type: "highlight", elements: [49,98]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,98,100]},{ type: "point", elements: [49]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48]},{ type: "background", elements: [98]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 97 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 165:
                if (track === 0) {
                    drawText("因為 49{×:乘}2=98\n所以殺掉 98", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1],  [{ type: "highlight", elements: [49,98]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,100]},{ type: "point", elements: [49]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48]},{ type: "background", elements: [98]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 48 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 97 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 166:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "49{×:乘}3=147 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1],  [{ type: "highlight", elements: [49,147]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,100]},{ type: "point", elements: [49]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [147]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 167:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[50]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[50]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 50{×:乘}[2] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1],  [{ type: "highlight", elements: [50]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,100]},{ type: "point", elements: [50]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1],  [{ type: "highlight", elements: [50,100]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,100]},{ type: "point", elements: [50]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49]},{ type: "background", elements: [100]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 99 }, { color: "rgba(51, 168, 51, 0.7)" ,width: "3" });
                }
                break;
            case 168:
                if (track === 0) {
                    drawText("因為 50{×:乘}2=100\n所以殺掉 100", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(82);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(83);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [50,100]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [50]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49]},{ type: "background", elements: [100]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 49 }, { group: "prime", index: 0 }, { color: "rgba(13, 102, 13, 0.8)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 0 }, { group: "isprime", index: 99 }, { color: "rgba(51, 168, 51, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 169:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "50{%:能夠整除}2=0", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面的留著給其他人殺"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(91);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [1]},{ type: "focus", elements: [0]}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(92);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [50,150]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [50]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [150]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    drawArrow({ group: "isprime", index: 49 }, { group: "prime", index: 1 }, { color: "rgba(255, 0, 0, 0.7)" ,label: "×" ,width: "3" });
                }
                if (track === 0) {
                    drawArrow({ group: "prime", index: 1 }, { group: "isprime", index: 149 }, { color: "rgba(255, 62, 62, 0.7)" ,label: "=" ,width: "3" });
                }
                break;
            case 170:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[51]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[51]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 51{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [51]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [51]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [51]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [51]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 171:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "51{×:乘}2=102 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [51,102]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [51]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [102]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 172:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[52]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[52]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 52{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [52]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [52]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [52]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [52]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 173:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "52{×:乘}2=104 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [52,104]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [52]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [104]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 174:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[53]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[53]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉53{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [53]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [53]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [53]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [53]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 175:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "53{×:乘}2=106 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [53,106]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [53]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [106]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 176:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[54]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[54]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 54{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [54]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [54]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [54]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [54]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 177:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "54{×:乘}2=108 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [54,108]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [54]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [108]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 178:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[55]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[55]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 55{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [55]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [55]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [55]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [55]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 179:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "55{×:乘}2=110 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [55,110]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [55]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [110]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 180:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[56]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[56]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 56{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [56]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [56]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [56]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [56]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 181:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "56{×:乘}2=112 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [56,112]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [56]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [112]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 182:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[57]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[57]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 57{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [57]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [57]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [57]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [57]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 183:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "57{×:乘}2=114 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [57,114]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [57]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [114]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 184:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[58]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[58]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 58{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [58]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [58]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [58]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [58]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 185:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "58{×:乘}2=116 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [58,116]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [58]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [116]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 186:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[59]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[59]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉59{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [59]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [59]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [59]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [59]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 187:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "59{×:乘}2=118 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [59,118]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [59]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [118]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 188:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[60]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[60]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 60{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [60]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [60]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [60]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [60]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 189:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "60{×:乘}2=120 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [60,120]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [60]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [120]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 190:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[61]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[61]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉61{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [61]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [61]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [61]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [61]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 191:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "61{×:乘}2=122 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [61,122]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [61]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [122]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 192:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[62]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[62]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 62{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [62]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [62]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [62]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [62]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 193:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "62{×:乘}2=124 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [62,124]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [62]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [124]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 194:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[63]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[63]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 63{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [63]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [63]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [63]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [63]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 195:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "63{×:乘}2=126 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [63,126]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [63]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [126]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 196:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[64]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[64]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 64{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [64]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [64]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [64]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [64]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 197:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "64{×:乘}2=128 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [64,128]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [64]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [128]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 198:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[65]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[65]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 65{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [65]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [65]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [65]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [65]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 199:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "65{×:乘}2=130 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [65,130]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [65]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [130]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 200:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[66]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[66]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 66{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [66]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [66]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [66]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [66]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 201:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "66{×:乘}2=132 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [66,132]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [66]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [132]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 202:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[67]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[67]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉67{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [67]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [67]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [67]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [67]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 203:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "67{×:乘}2=134 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [67,134]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [67]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [134]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 204:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[68]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[68]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 68{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [68]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [68]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [68]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [68]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 205:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "68{×:乘}2=136 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [68,136]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [68]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [136]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 206:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[69]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[69]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 69{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [69]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [69]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [69]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [69]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 207:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "69{×:乘}2=138 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [69,138]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [69]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [138]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 208:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[70]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[70]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 70{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [70]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [70]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [70]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [70]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 209:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "70{×:乘}2=140 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [70,140]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [70]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [140]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 210:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[71]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[71]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉71{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [71]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [71]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [71]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [71]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 211:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "71{×:乘}2=142 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [71,142]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [71]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [142]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 212:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[72]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[72]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 72{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [72]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [72]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [72]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [72]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 213:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "72{×:乘}2=144 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [72,144]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [72]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [144]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 214:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[73]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[73]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉73{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [73]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [73]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [73]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [73]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 215:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "73{×:乘}2=146 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [73,146]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [73]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [146]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 216:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[74]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[74]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 74{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [74]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [74]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [74]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [74]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 217:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "74{×:乘}2=148 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [74,148]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [74]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [148]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 218:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[75]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[75]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 75{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [75]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [75]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [75]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [75]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 219:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "75{×:乘}2=150 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [75,150]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [75]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [150]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 220:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[76]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[76]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 76{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [76]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [76]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [76]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [76]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 221:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "76{×:乘}2=152 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [76,152]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [76]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [152]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 222:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[77]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[77]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 77{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [77]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [77]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [77]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [77]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 223:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "77{×:乘}2=154 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [77,154]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [77]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [154]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 224:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[78]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[78]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 78{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [78]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [78]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [78]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [78]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 225:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "78{×:乘}2=156 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [78,156]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [78]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [156]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 226:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[79]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[79]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉79{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [79]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [79]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [79]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [79]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 227:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "79{×:乘}2=158 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [79,158]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [79]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [158]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 228:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[80]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[80]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 80{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [80]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [80]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [80]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [80]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 229:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "80{×:乘}2=160 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [80,160]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [80]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [160]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 230:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[81]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[81]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 81{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [81]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [81]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [81]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [81]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 231:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "81{×:乘}2=162 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [81,162]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [81]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [162]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 232:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[82]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[82]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 82{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [82]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [82]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [82]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [82]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 233:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "82{×:乘}2=164 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [82,164]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [82]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [164]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 234:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[83]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[83]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉83{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [83]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [83]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [83]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [83]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 235:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "83{×:乘}2=166 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [83,166]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [83]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [166]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 236:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[84]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[84]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 84{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [84]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [84]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [84]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [84]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 237:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "84{×:乘}2=168 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [84,168]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [84]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [168]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 238:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[85]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[85]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 85{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [85]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [85]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [85]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [85]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 239:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "85{×:乘}2=170 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [85,170]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [85]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [170]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 240:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[86]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[86]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 86{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [86]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [86]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [86]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [86]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 241:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "86{×:乘}2=172 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [86,172]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [86]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [172]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 242:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[87]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[87]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 87{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [87]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [87]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [87]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [87]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 243:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "87{×:乘}2=174 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [87,174]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [87]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [174]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 244:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[88]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[88]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 88{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [88]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [88]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [88]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [88]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 245:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "88{×:乘}2=176 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [88,176]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [88]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [176]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 246:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[89]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[89]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉89{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [89]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [89]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [89]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [89]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 247:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "89{×:乘}2=178 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [89,178]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [89]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [178]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 248:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[90]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[90]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 90{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [90]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [90]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [90]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [90]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 249:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "90{×:乘}2=180 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [90,180]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [90]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [180]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 250:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[91]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[91]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 91{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [91]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [91]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [91]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [91]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 251:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "91{×:乘}2=182 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [91,182]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [91]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [182]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 252:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[92]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[92]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 92{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [92]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [92]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [92]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [92]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 253:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "92{×:乘}2=184 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [92,184]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [92]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [184]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 254:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[93]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[93]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 93{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [93]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [93]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [93]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [93]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 255:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "93{×:乘}2=186 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [93,186]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [93]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [186]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 256:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[94]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[94]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 94{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [94]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [94]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [94]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [94]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 257:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "94{×:乘}2=188 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [94,188]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [94]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [188]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 258:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[95]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[95]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 95{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [95]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [95]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [95]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [95]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 259:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "95{×:乘}2=190 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [95,190]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [95]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [190]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 260:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[96]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[96]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 96{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [96]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [96]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [96]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [96]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 261:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "96{×:乘}2=192 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [96,192]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [96]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [192]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 262:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[97]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " 所以將其放入 prime"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[97]={true:是質數}", bg_color: "rgba(47, 255, 82, 0.44)"},{text: " {所以}將其放入 prime\n並且一口氣殺掉97{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [97]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [97]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [97]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [97]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 263:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "97{×:乘}2=194 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [97,194]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [97]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [194]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 264:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[98]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[98]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 98{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [98]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [98]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [98]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [98]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 265:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "98{×:乘}2=196 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [98,196]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [98]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [196]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 266:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[99]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[99]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 99{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [99]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [99]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [99]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [99]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 267:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "99{×:乘}2=198 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [99,198]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [99]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [198]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 268:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[100]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " 所以不是質數"}], 0, 0);
                }
                if (track === 1) {
                    drawColoredText([{text: "因為 "},{text: "{isprime}[100]={false:不是質數}", bg_color: "rgba(234, 64, 64, 0.44)"},{text: " {所以}不是質數\n並且一口氣殺掉 100{×:乘}[] {這幾個}"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(51);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(52);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [100]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [100]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(53);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: []},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 1) {
                    addEditorHighlight(54);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [100]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [100]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99]},{ type: "background", elements: []}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 269:
                if (track === 0) {
                    drawColoredText([{text: "因為 "},{text: "100{×:乘}2=200 已經超過 100", bg_color: "rgba(241, 255, 47, 0.44)"},{text: "\n所以後面省略"}], 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(70);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [{ type: "highlight", elements: [0]},{ type: "focus", elements: []}], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(71);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "highlight", elements: [100,200]},{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]},{ type: "point", elements: [100]},{ type: "mark", elements: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99]},{ type: "background", color: "rgba(255, 82, 82, 0.44)", elements: [200]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
            case 270:
                if (track === 0) {
                    drawText("最後就完成了", 0, 0);
                }
                if (track === 0) {
                    addEditorHighlight(120);
                    drawArray('prime', 0, 560, [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97],  [], [0], "normal", 10, 0, [],  [],  [],  [],  []);
                }
                if (track === 0) {
                    addEditorHighlight(121);
                    drawArray('isprime', 0, 90, [0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1,1,1],  [{ type: "focus", elements: [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97]}], [1,100], "normal", 10, 2, [],  [],  [],  [],  []);
                }
                break;
        }
    }
    let currentFrame = 0;
    const totalFrames = 271;
    const keyFrames = [2,2,4,4,7,7,10,10,14,14,17,17,22,22,25,25,29,29,32,32,38,38,41,41,47,47,50,50,54,54,57,57,62,62,65,65,70,70,73,73,77,77,80,80,84,84,87,87,91,91,94,94,98,98,101,101,105,105,108,108,112,112,115,115,119,119,122,122,125,125,128,128,131,131,134,134,137,137,140,140,143,143,146,146,149,149,152,152,155,155,158,158,161,161,164,164,167,167,170,170,172,172,174,174,176,176,178,178,180,180,182,182,184,184,186,186,188,188,190,190,192,192,194,194,196,196,198,198,200,200,202,202,204,204,206,206,208,208,210,210,212,212,214,214,216,216,218,218,220,220,222,222,224,224,226,226,228,228,230,230,232,232,234,234,236,236,238,238,240,240,242,242,244,244,246,246,248,248,250,250,252,252,254,254,256,256,258,258,260,260,262,262,264,264,266,266,268,268];
    const stopFrames = [269,270];
    const fastFrames = [];
    const fastonFrames = [21];
    const skipFrames = [72];

    function findNextKey(frame) {
        let L = 0, R = keyFrames.length - 1;
        let ans = (keyFrames.length > 0?keyFrames[keyFrames.length-1] : totalFrames - 1);
        while (L <= R) {
            const M = Math.floor((L + R) / 2);
            if (keyFrames[M] > frame) {
                ans = keyFrames[M];
                R = M - 1;
            } else {
                L = M + 1;
            }
        }
        return ans;
    }

    function findPrevKey(frame) {
        let L = 0, R = keyFrames.length - 1;
        let ans = (keyFrames.length > 0?keyFrames[0] : 0);
        while (L <= R) {
        const M = Math.floor((L + R) / 2);
            if (keyFrames[M] < frame) {
                ans = keyFrames[M];
                L = M + 1;
            } else {
                R = M - 1;
            }
        }
        return ans;
    }

    window.CodeScript = {
        next() {
            track = 0;
            if (currentFrame < totalFrames - 1) {
                currentFrame++;
                renderFrame(currentFrame);
            }
        },
        prev() {
            track = 0;
            if (currentFrame > 0) {
                currentFrame--;
                renderFrame(currentFrame);
            }
        },
        next_key_frame() {
            if (keyFrames.length > 0){
                track = 1;
                currentFrame = findNextKey(currentFrame);
                renderFrame(currentFrame);
            }
        },
        prev_key_frame() {
            if (keyFrames.length > 0){
                track = 1;
                currentFrame = findPrevKey(currentFrame);
                renderFrame(currentFrame);
            }
        },
        reset() {
            track = 0;
            currentFrame = 0;
            renderFrame(0);
        },
        goto(n) {
            if (n >= 0 && n < totalFrames) {
                track = 0;
                currentFrame = n;
                renderFrame(n);
            } else if (n == -1) {
                track = 0;
                currentFrame = totalFrames - 1;
                renderFrame(totalFrames - 1);
            }
        },
        get_frame_count() {
            return totalFrames;
        },
        get_current_frame_index() {
            return currentFrame;
        },
        get_key_frames() {
            return keyFrames;
        },
        get_stop_frames() {
            return stopFrames;
        },
        is_stop_frame() {
            return stopFrames.includes(currentFrame);
        },
        is_fast_frame() {
            return fastFrames.includes(currentFrame);
        },
        is_faston_frame() {
            return fastonFrames.includes(currentFrame);
        },
        is_skip_frame() {
            return skipFrames.includes(currentFrame);
        }
    };
    document.addEventListener('DOMContentLoaded', () => {
        CodeScript.reset();
    });
})();

